{
  "title": "Recommendation of usable enzymes",
  "content": "For the given genome and restriction enzymes, we can give the following recommendations. <br><br><h6>Graph</h6> The graph shows the amount of digested fragments with respect to the fragment size. The different enzymes are visualized in different colored lines with the respective color being visible on the legend in the right. <br><br><h6>Table</h6>In terms of sequencing cost, the table beneath the graph presents the calculated results. As header (in grey), the name of the uploaded fasta file (genome) and certain adjustments selected in the lower part of the form (paired end, sequencing yield and coverage) are presented. The table itself shows the digesting enzyme pairs which are also candidate pairs for the query analysis. The rest of the row is divided into theoretical, which are based on foundational calculations, and predicted, which are the respectively corrected values based on (cite paper), values. Hence, the predicted values are higher, since a higher number of adapter contamination and overlaps are expected. Firstly, for each enzyme pair the number of fragments and the respectively produced numbers of base pairs in silico digested are shown. Based on this, the number of samples which would (theoretically/predictably) be sequenced at the same time (No. samples multiplexable) can measured. Here it is important to note that the number tend to be overestimated and since it can vary even to the project level, a precise estimation is missing. Furthermore, the net number of base pairs sequenced in once lane by deducting adaptor contaminated and overlapping regions is given. The columns afterwards show the entry for the read length to be sequenced, as the actual purpose for these columns are to show the adapter contamination (fragments under read length) and number of overlaps (fragments between read length and its doubled value). In the last column a double range slider is provided in order to provide a size selection for the given digestion. In the range slider up to two markers are placed marking the range for the read length sizes, depending on being a paired or single end read. <br><br><h6>Usage</h6>As this table gives different information about the sequencing output, you can compare the different recommended enzyme pairs in several ways. The row of the enzyme pair turns red, when the given size selection does not provide the desired amount of SNPs. Based on the needs of the experiment, you can choose an optimal size selection with information of the adaptor contamination and, in case of paired end sequencing, overlaps.<br><br> For more information, please read (cite paper)."
}