{
  "introductionContent": "ddgRADer was developed to make designing double-digest restriction site associated DNA sequencing (ddRADseq) experiments more efficient and accessible. It helps the user choose the pair of enzymes, size selection cutoffs, and number of samples to be multiplexed per lane, while maximizing sequencing efficiency (by minimizing adaptor contamination and overlapping read pairs). Depending on the user-provided reference genome sequence and desired study design, ddgRADer gives recommendations of enzyme pairs or allows the user to explore enzyme pairs of their choice. The user can also try out different size selection parameters for any given enzyme pair and predict the expected number of loci (SNPs) and the sequencing efficiency (resulting from the predicted amount of adaptor contamination and overlapping read pairs).",
  "sequencyEffiencyOfPairedEndSequencing": "Normally, paired-end sequencing library construction protocols aim at fragment lengths that are longer than twice the read length: <img class='center' src='static/images/normalpairedend.png'/> <br> However, they often contain (inadvertently) in a certain proportion of fragments that are between one and two read lengths. Such a fragment will result in a pair of reads that are partially overlapping. In the following example 50 bases of sequence data go to waste because the same genomic segment is sequenced twice: <img class='center' src='static/images/overlap.png'/> <br> Even worse, some fragments may be shorter than a single read length, resulting in both read overlap and adaptor contamination - the 3’ end of each read will contain part of the artificial Illumina adaptor sequence. In the following example 200 bases of sequencing go to waste (out of 300 bases, we obtain only 100 bases of useful information): <img class='center' src='static/images/adapterContamination.png'/> <br> Sequencing efficiency of a ddRADseq experiment can be defined as the proportion of sequenced bases that are not wasted due overlaps and contamination." ,
  "goalContent": "ddRAD sequencing is a popular, flexible, and cost-effective method for providing insights into the genetic architecture of populations. In order to assist beginners and allow optimization of the protocol, ddgRADer conducts in silico digestion of the genome, predicts the number of SNPs that can be obtained, and estimates sequencing efficiency. Many ddRADseq experiments end up wasting a large proportion of the sequencing effort due to unintended read overlaps and adaptor contamination. In an empirical comparative study (Lajmi et al.), we observed a large proportion of adaptor contamination and read overlaps despite the use of size selection methods (e.g. using the Bluepippin instrument). The conclusions of that study are used by ddgRADer to make predictions. Different candidate enzyme pairs can be compared in terms of the number of genomic bases that would be sequenced, the number of samples multiplexable, and the expected level of adaptor contamination and read overlaps. Based on the experience of the user, there are two usage modes as explained below.",
  "noIdea": "ddgRADer will suggest pairs out of commonly used restriction enzymes that should be suitable for the genome uploaded by the user and the desired study design. We chose EcoRI, PstI, SbfI and SphI as rare cutters. With EcoRI the most common frequent cutters in the literature were MseI, MspI, SphI, SbfI and NlaIII. With PstI it was MspI, SphI, MseI and HhaI. With SbfI:EcoRI, MseI, MspI and SphI. And finally with SphI we chose MluCI as the frequent cutter. Some restriction enzymes (e.g. EcoRI) can be used as either the rare cutter or the frequent cutter (see below). These combinations were chosen due to their frequent use in literature. ddgRADer virtually cuts the genome with every enzyme combination and predicts the number of fragments and fragment length distribution that will be produced. In the end, the up to 5 combinations are chosen that will result in the desired number of loci (single nucleotide polymorphisms; SNPs). In the experimental design of a demographic analysis, we aim at a certain desired ‘Number of SNPs to be genotyped’ (a parameter that needs to be defined by the user). In contrast to this, in experimental design of a genome scan analysis, the desired number of SNPs per 100,000 bp window is specified by the user. See below for some example studies for the different analysis types. In both cases, enzyme pairs are excluded if the number of cut sites of the rare cutter is less than the desired number of SNPs. Next, for each enzyme pair, ddgRADer calculates the number of genomic nucleotides that will be sequenced. Here, the number of base pairs in each fragment size bin is calculated by multiplying the number of fragments in each bin with the fragment size (e.g. if the bin of 90,100 contains 10 fragments, the number of base pairs would be 1000). The number of sequenced nucleotides is then summed over all fragments between 300 and 700 bp and multiplied by the expected polymorphism (expected number of SNPs per kbp). If this value is smaller than the desired number of SNPs to be genotyped, then these enzyme pairs are excluded. In the end, five pairs are presented that are predicted to give a number of SNPs closest to the desired number (the first one has the smallest predicted number of SNPs, while the latest one the largest).",
  "lemmeTryOut": "Here, the user is able to compare potential choices of enzyme pairs. The user enters the pairs using the drop-down menus, and can add more pairs by pressing the + symbol. It is recommended to enter the sequencing parameters below, which is needed to calculate the expected number of SNPsyas explained above for the “I have no idea” mode.",
  "demographicAnalysis": "The number of SNPs required for analysis may vary depending on the questions being addressed. For example, one thousand SNPs may be sufficient for a typical population structure analysis (e.g. the STRUCTURE algorithm used in Privman et al. 2018 (<a href='https://doi.org/10.1111/mec.14767' target='_blank' rel='noopener noreferrer'>doi.org/10.1111/mec.14767</a>). Demographic inference using more complex models such as the estimation of migration between population may require more (e.g. the multispecies-coalescent-with-introgression model used in Flouri et al. 2020 <a href='https://doi.org/10.1093/molbev/msz296' target='_blank' rel='noopener noreferrer'>doi:10.1093/molbev/msz296</a>).",
  "genomeScan": "For genomic scan analyzes it is desirable to have a certain density of SNPs in the genotype data. Often, a sliding-window approach is used to estimate some population genetic statistic across the genome (e.g. Fst), and it is desirable to have a certain number of SNPs in a window of a certain size. For example, one may want at least 10 SNP in a window of 100Kbp. See for example the Fst outlier analysis in Privman et al. 2018 (<a href='https://doi.org/10.1111/mec.14767' target='_blank' rel='noopener noreferrer'>doi.org/10.1111/mec.14767</a>), which used a dataset with about 40 SNPs per 100Kbp.",
  "estimatingSNPIntro": "The SNP density of a population is the average number of single nucleotide polymorphisms (SNPs) per kilobase of genomic sequence. The expected number of SNPs varies greatly depending on the study organism, the population sampled, and the number of samples. For example, in pedigree or linkage map analyses the number of SNPs would be smaller, as samples are taken from a single family, compared to phylogeographic studies that involve samples from multiple populations across the entire species range. A sample from a single location/population would have an intermediate number of SNPs, which would depend on the genetic diversity of that population (e.g. whether it has recently undergone a population bottleneck).<br>Three major factors contribute to the estimation of the SNP density:<br><ul style='margin: auto; text-align: left;'><li><b>Species</b>: Different species have different densities of polymorphic sites in their genome.To give an example, amphioxus has a much larger number of SNPs per kbp than humans (see below).</li><li><b>Study population</b>: The study population is an important factor for the SNP density. A study of a single family for a pedigree analysis would result in far fewer SNPs than a sample from the whole population of the species. Also the SNP density of different populations may differ. A population bottleneck effect (e.g. in a founder population) may dramatically reduce the number of SNPs in a population In humans, for example, the population of Iceland has a lower SNP density than the population in Ethiopia because of the founder effect that occurred during the colonization of Iceland. </li><li><b>Sample size</b>: Since each individual of a sample contributes to the overall number of SNPs, the sample size affects the expected SNP density.</li></ul>",
  "exampleSNPDensity": "<ul style='margin: auto; width: 50%; text-align: left;'><li>X Humans: a SNP with allele frequency >1% is found in every 300bp of the human genomes, i.e., expected SNP density of 3 per kbp for a sample size of 100. (<a href='https://doi.org/10.1093/hmg/11.17.1987' target='_blank' rel='noopener noreferrer'>doi.org/10.1093/hmg/11.17.1987</a>) </li><li>a study of fire ant populations discovered ~2 SNPs per kbp (<a href='https://doi.org/10.1111/mec.14767' target='_blank' rel='noopener noreferrer'>doi.org/10.1111/mec.14767</a>)</li><li>Amphioxus: the whole-genome sequencing of a single diploid individual revealed 3.7% heterozygosity, i.e. about 30 SNPs per kbp for a sample size of two haploid genomes (<a href='https://doi.org/10.1038/nature06967' target='_blank' rel='noopener noreferrer'>doi.org/10.1038/nature06967</a>)</li><li>Arabidopsis: ~2 SNPs per kbp in a comparison between two accessions (<a href='https://doi.org/10.1101/gr.127522.111' target='_blank' rel='noopener noreferrer'>doi.org/10.1101/gr.127522.111</a>)</li></ul>",
  "baseCutters": "There is a great diversity of restriction enzymes, differing in the size of their restriction sites. For the most commonly used enzymes, the restriction sites are 4, 6 or 8 base pairs long and often occur as palindromes. The bigger the size (8-cutter) is, the less likely it is to cut the genome and the smaller the size (4-cutter) is, the more likely it is to cut the genome. It is common practice to combine a rare cutter with a frequent cutter, as the rare cutter determines the frequency of the fragments and the frequent cutter the length of the fragments. A cutter is determined as frequent or rare, depending on the other cutter used in the process. E.g. EcoRI (6-cutter) is commonly used as a rare cutter, because in many experiments it is combined with a 4-cutter (e.g. MseI). However, when used with a 8-cutter (e.g. SbfI), it is considered a frequent cutter. The optimal choice of enzymes is based on genome, experiment and sequencing method.",
  "gcContentRestrictionSite": "Based on the GC content, restriction sites can occur differently often. For a genome with a GC content of 50% and no dinucleotide bias, a 4-cutter is expected to cut every 256 (4^4) bases, a 6-cutter ever 4096 (4^6) bases and the 8-cutter to cut every 65536 (4^8) bases. It can be calculated by the formula (0.5 x GC)a x (0.5 x AT)b , with GC and AT the amount of GC or AT in the genome and their occurence in the respective restriction site is given through a (GC) and b (AT).",
  "overlapsContaminationContent": "Adaptor contamination: fragments shorter than the read length, part of the adaptors would be sequenced. Overlaps: During paired-end sequencing, a DNA fragment is sequenced from either end. For short fragments, this could result in sequencing a stretch of the fragment twice. As the main focus of this tool is the evaluation of overlaps and adaptor contamination during sequencing, the amount of these are important for the enzyme choice. According to our results (cite) the frequent cutter determines the length of the fragments, it is the key driver for the amount of adaptor contamination in the data which ultimately results in the wastage of sequencing. Different frequent cutters result in a different course of numbers of fragments with rising length, so some cutters produce more less sized fragments than others. Even though a size selection is applied to the sequenced data, the samples show a not ignorable amount of adapter contamination and overlaps. Enzyme pairs showing a higher skew towards fragments with lower size, tend to include more adapter contamination, even though a size selection has been applied.",
  "tableMetricsGraph": "The graph shows the number of fragments generated by insilico digestion of various fragment sizes. Different colors indicate the enzyme pairs used as indicated in the legend.",
  "tableMetricsTable": "To optimize sequencing effort, the table beneath the graph presents the theoretical expectations (“theoretical” row) as well as more realistic predictions that are based on empirical experiments (“prediction” row). The table shows the results for in silico-digestion by different choices of enzyme pairs. The theoretical expectations assume that size selection is 100% effective. The predicted values for overlaps and contamination are higher because size selection fails to exclude some of the short fragments. <br><br> In order to simplify the explanation of the calculation, it is assumed to have taken a paired read sequencing run with a read length of 150. The fragments are binned into buckets of a size of 10. <br><br> Calculation of theoretical values: <br> The basis of the calculation of the theoretical values is the amount of genomic fragments which is just calculated by summing up the fragments within the selected range of bins. The number of base pairs is then calculated by taking the highest amount of fragment within the bin. So if the bin of 10,20 would contain 3 fragments, the amount of base pairs would be 60. <br>  The maximal number multiplexable is the division of the sequencing yield with the division of the total number of genomic fragments with the desired coverage. The total amount of genomic fragments are the <br><br> <span class='center formula'>maximalNumberMultiplexable = sequencing yield &#247; amount of genomic fragments &#247; sequencing depth </span> <br> The sequence efficiency is the product of the number of samples multiplexible and the summation of all bases of all bins within the chosen range. <br><br> <span class='center formula'>sequence Efficiency = maximalNumberMultiplexable &times; sumBasesOfSelectedBins </span> <br> Calculation of predictions based on empirical experiments: <br> These calculations predict an additional amount of adaptor contamination and overlaps on top of the theoretical expectations. We calculate these amounts using two factors aa and ao that represent the percentage of short fragments that sneak past size selection for adaptor contamination and read overlaps, respectively (these factors were derived from experimental results). The number of fragments with adaptor contamination that size selection should exclude is the sum of the size bins up to one read length, e.g. 150bp. This number is multiplied by the factor aa to get the number of fragments that gets past size selection. If the first size selection cutoff (the position of the first slider) is less than 150, we only sum the bins up to the slider. Similarly for read overlaps, we sum the bins between 150 and 300 and then multiply by ao. If the slider is in between, then the bins are summed up to the position of the slider.<br><br> <img class='center' src='static/images/adpatorContaminationFormula.png'/> <br> <img class='center' src='static/images/overLapsFormula.png'/>  <span class='center imagesubtitle'>where aa is the adapter contamination factor, and ao is the overlap factor </span><br> The theoretical number of base pairs are calculated as follows:<br><br> the number of fragments in the intervals are multiplied by its highest fragment length, so for example if the bin of (0;10] contains 10 fragments, then the number of base pairs would be taken as 100. For the experimental value, this number is added by the product of read length and adaptor contamination times 2/3 and the number of overlaps times the read length.<br><br> <span class='center formula'> predictedSumBasesOfBin  = theorheticalSumBasesInSelectedFragmentRange &#43; additionalAdaptorContamination &times; 2/3  &times; read length &#43; additional Overlaps &times; read length </span><br><br><b>Enzyme pair:</b> A pair of restriction enzyme used to digest the given genome<br> <b>No. of fragments:</b> The total number of fragments generated of 0 – 1010bp size by the insilico digestion of the given genome with a pair of restriction enzymes.<br><b>No. of base pairs:</b> Total number of basepairs that constitute the fragments generated of 0 –1010 bp in size. This is calculated as No. of fragments in a 10 bp bin x size of the largest fragment in the bin.<br><b>Estimated no. of SNPs:</b> Given the expected polymorphism and the genome size, this is the number of SNPs expected.<br><b>No. of samples multiplexed:</b> calculated based on the sequencing yield, size selection parameter and the depth required by the user. <b> This is an overestimation and must be interpreted carefully.</b><br><br><div  class='All'><span class='Fraction'><span class='Numerator'>sequencing yield</span><span class='Denominator'>total number of genomic fragments in the size selected range &times; depth</span></span></div><br><b>No. of base pairs sequenced in a lane:</b> This is the effective yield of sequencing data, after deducting adaptor contaminated regions and taking into account overlaps. <br><b>Fragments under 150 bp:</b> Fragments shorter than the read length (150 bp or 100 bp typically) are expected to have adaptor contamination. This is calculated based on the size selection criteria used. The predicted value is based on corrections from empirical data and larger than the theoretical value as smaller fragments tend to get sequenced more easily. <br><b>Fragments between 150 – 300 bp:</b> Fragments of this size range in paired-end data have overlapping reads. While this is less problematic than adaptor contamination and does not affect data quality, this could lead to less efficient sequencing. <br><b>Range adjustment:</b> This slider can be used to decide the size selection parameters given a pair of restriction enzymes. <br>As this table gives different information about the sequencing output, you can compare different pairs of restriction enzymes. The row of the enzyme pair turns red, when the given size selection does not provide the desired amount of SNPs. Based on the needs of the experiment, you can choose an optimal size selection criteria that minimizes adaptor contamination and in case of paired-end sequencing, overlaps. <br><br>For more information, please read (cite paper).",
  "howToCite": "TBA.",
  "feedback": "Please email to flxglnk@gmail.com for bugs, feedback and comments."
}