{
  "introductionContent": "ddgRADER was developed to make designing ddRADseq experiments more accessible in terms of choice of enzyme pairs and number of samples to be multiplexed while minimizing adaptor contamination and overlapping reads. Depending on the query, ddgRADER gives recommendations of pairs of enzymes or different pairs can be tried out. It is also possible to select the size range of fragments of the given enzyme pairs, so different adjustments are easily comparable.",
  "goalContent": "As ddRAD sequencing is a flexible and cost-effective method for providing in-depth insights into the genetic architecture of organisms, used by many studies. In order to further optimize this process, ddgRADER provides theoretical and predicted sequencing costs of the query ddRAD simulation. The predicted calculations are based on the calculation of (cite), as the real world size selection is more complicated and contains a lot of (adaptor) contamination, so the different pairs of enzymes are comparable in different values like number of fragments, samples multiplexable and contamination. Furthermore, it is possible to get up to five recommendations which enzyme pairs to use for the given genome and sequencing adjustments. The enzyme pairs are chosen from a pool of commonly used enzyme pairs. For a more detailed and brighter comparison, the try out function is recommended. With this, it is easy to choose the correct enzyme pairs for the experiments.",
  "estimatingSNPIntro": "The SNP density of an organism describes its number of SNPs within a certain size of genomic region. The counting unit can be various (in this tool we assume 100 kb).",
  "popStructureAnalysis": "The expected number of nucleotide polymorphism vary hugely depending on the study organism and the scale of the study. For example, in pedigree or linkage map analyses nucleotide polymorphism would be very low as samples are from a single family compared to phylogeographic studies that involve samples from multiple populations.",
  "genomeScan": "The expected number of single nucleotide polymorphisms (SNPs) vary greatly depending on the study organism, the population sampled, and the number of samples. For example, in pedigree or linkage map analyses the number of SNPs would be smaller, as samples are from a single family, compared to phylogeographic studies that involve samples from multiple populations across the entire species range. A sample from a single location/population would have an intermediate number of SNPs, which would depend on the genetic diversity of that population (e.g. whether it has recently undergone a population bottleneck).",
  "exampleSNPDensity": "<ul style='margin: auto; width: 35%; text-align: left;'><li>Human: 80 SNPs per kb (Zhao et al. 2003)</li><li>Ant:</li><li>Amphioxus: </li><li>Arabidopsis: 1 SNP per kb (Lu et al. 2012)</li></ul>",
  "influencingFactors": "<ol style='margin: auto; width: 100%; text-align: left;'><li>Genome size:<br>The bigger the genome is, there more SNPs do likely occur.</li><li>Nucleotide polymorphism:<br>Different species or even various regions within the genome have a different rate of a nucleotide substitution. For example, non-coding regions tend to have a higher substitution rate than coding sequences. These factors are determined by the recombination and mutation rate.</li><li>Demographic history (bottleneck):<br>The bottleneck effect has a crucial influence on the genomes with the populations. As the massive reduction of the population size results in a big loss of genetic variety, also the amount of SNPs within a population shrinks. With this loss of genetic variety, certain SNPs of individuals get lost, which again result in a reduction of SNPs and its density within the populations.</li></ol>",
  "baseCutters": "There are different kinds of cutters for enzymes, depending on the size of the restriction sites. The bigger the size (8-cutter) is, the less likely it is to cut the genome and the smaller the size (4-cutter) is, the more likely it is to cut the genome. It is very common to combine a rare cutter with a frequent cutter, as the rare cutter determines the frequency of the fragments and the frequent cutter the length of the fragments.",
  "gcContentRestrictionSite": "Based on the GC content, restriction sites can occur differently often. For a genome with a GC content of 50% and no dinucleotide bias, a 4-cutter is expected to cut every 256 (4^4) bases, a 6-cutter ever 4096 (4^6) bases and the 8-cutter to cut every 65536 (4^8) bases. It can be calculated by the formula (0.5 x GC)a x (0.5 x AT)b , with GC and AT the amount of GC or AT in the genome and their occurence in the respective restriction site is given through a (GC) and b (AT).",
  "overlapsContaminationContent": "As the main focus of this tool is the evaluation of overlaps and adaptor contamination during sequencing, the amount of these are important for the enzyme choice. According to our results (cite) the frequent cutter determines the length of the fragments, it is the key driver for the amount of adaptor contamination in the data which ultimately results in the wastage of sequencing.Different frequent cutters result in a different course of numbers of fragments with rising length, so some cutters produce more less sized fragments than others. Even though a size selection is applied to the sequenced data, the samples show a not ignorable amount of adapter contamination and overlaps. Enzyme pairs showing a higher skew towards fragments with lower size, tend to include more adapter contamination, even though a size selection has been applied.",
  "tableMetricsGraph": "The graph shows the number of fragments generated by insilico digestion of various fragment sizes. Different colors indicate the enzyme pairs used as indicated in the legend.",
  "tableMetricsTable": "To optimize sequencing effort, the table beneath the graph presents the theoretical calculations as well as more realistic predicted calculations that are based on empirical datasets. As header (in grey), the name of the uploaded fasta file (genome) and certain adjustments selected in the lower part of the form (paired end, sequencing yield and coverage) are presented. The table itself shows the insilico-digested enzyme pairs which are also candidate pairs for the query analysis. The rest of the row is divided into theoretical, which are based on foundational calculations, and predicted, which are the respectively corrected values based on (cite paper), values. The predicted values are higher, since a higher number of fragments with adapter contamination and overlaps are seen in empirical data. <br><b>Enzyme pair:</b> A pair of restriction enzyme used to digest the given genome<br><b>No. of fragments:</b> The total number of fragments generated of 0 – 1010bp size by the insilico digestion of the given genome with a pair of restriction enzymes.<br><b>No. of base pairs:</b> Total number of basepairs that constitute the fragments generated of 0 –1010 bp in size. This is calculated as No. of fragments in a 10 bp bin x size of the largest fragment in the bin.<br><b>Estimated no. of SNPs:</b> Given the expected polymorphism and the genome size, this is the number of SNPs expected.<br><b>No. of samples multiplexed:</b> calculated based on the sequencing yield, size selection parameter and the depth required by the user. <b> This is an overestimation and must be interpreted carefully.</b><br><br><div  class='All'><span class='Fraction'><span class='Numerator'>sequencing yield</span><span class='Denominator'>total number of genomic fragments in the size selected range &times; depth</span></span></div><br><b>No. of base pairs sequenced in a lane:</b> This is the effective yield of sequencing data, after deducting adaptor contaminated regions and taking into account overlaps. <br><b>Fragments under 150 bp:</b> Fragments shorter than the read length (150 bp or 100 bp typically) are expected to have adaptor contamination. This is calculated based on the size selection criteria used. The predicted value is based on corrections from empirical data and larger than the theoretical value as smaller fragments tend to get sequenced more easily. <br><b>Fragments between 150 – 300 bp:</b> Fragments of this size range in paired-end data have overlapping reads. While this is less problematic than adaptor contamination and does not affect data quality, this could lead to less efficient sequencing. <br><b>Range adjustment:</b> This slider can be used to decide the size selection parameters given a pair of restriction enzymes. <br>As this table gives different information about the sequencing output, you can compare different pairs of restriction enzymes. The row of the enzyme pair turns red, when the given size selection does not provide the desired amount of SNPs. Based on the needs of the experiment, you can choose an optimal size selection criteria that minimizes adaptor contamination and in case of paired-end sequencing, overlaps. <br><br>For more information, please read (cite paper).",
  "howToCite": "TBA."
}