{
  "basepairLengthToBeSequencedHelp": {
    "title": "Read length to be sequenced",
    "content": "The number of basepairs sequenced from each DNA fragment in the library (the number of sequencing cycles)."
  },
    "sequencingYieldHelp": {
    "title": "Expected sequencing yield per lane",
    "content": "How many million reads are expected from a single lane of the sequencer (single reads for single-end sequencing; pairs of reads for paired-end sequencing). This varies depending on the Illumina sequencer model. Ask your service provider for an estimate."
  },
  "popStructNumberOfSnps": {
    "title": "Total number of SNPs across the whole genome required for the intended analysis",
    "content": "The number of SNPs required for analysis may vary depending on the questions being addressed. For example, one thousand SNPs may be sufficient for a typical population structure analysis (e.g. the STRUCTURE algorithm used in Privman et al. 2018 <a id='privmanModRef' href='https://doi.org/10.1111/mec.14767' target='_blank' rel='noopener noreferrer'>doi: https://doi.org/10.1111/mec.14767</a>). Demographic inference using more complex models such as the estimation of migration between population may require more (e.g. the multispecies-coalescent-with-introgression model used in Flouri et al. 2020 <a id='flouriModRef' href='https://doi.org/10.1093/molbev/msz296' target='_blank' rel='noopener noreferrer'>doi:10.1093/molbev/msz296</a>)."
  },
  "popStructPopSnpDensity": {
    "title": "Expected SNP density in study population",
    "content": "Average number of SNPs per kilobase. For a detailed explanation see the user guide. The expected number of single nucleotide polymorphisms  (SNPs) varies greatly depending on the study organism, the population sampled, and the number of samples. For example, in pedigree or linkage map analyses the number of SNPs  would be smaller, as samples are from a single family, compared to phylogeographic studies that involve samples from multiple populations across the entire species range. A sample from a single location/population would have an intermediate number of SNPs, which would depend on the genetic diversity of that population (e.g. whether it has recently undergone a population bottleneck)."
  },
  "genomeScanPopSnpDensity": {
    "title": "Expected SNP density in study population",
    "content": "Average number of SNPs per kilobase. For a detailed explanation see the user guide. The expected number of single nucleotide polymorphisms  (SNPs) varies greatly depending on the study organism, the population sampled, and the number of samples. For example, in pedigree or linkage map analyses the number of SNPs  would be smaller, as samples are from a single family, compared to phylogeographic studies that involve samples from multiple populations across the entire species range. A sample from a single location/population would have an intermediate number of SNPs, which would depend on the genetic diversity of that population (e.g. whether it has recently undergone a population bottleneck)."
  },
  "genomeScanRadSnpDensity": {
    "title": "Average number of SNPs in a 100Kb window that is required for the study",
    "content": "For studies that require SNPs to be distributed across the genome, such as Fst scans across the genome or other methods looking for signatures of selection."
  },
  "basepairsSequencedHelp": {
    "title": "Sequence efficiency",
    "content": "Percentage of sequenced bases that are not wasted due to adaptor contamination and read overlaps."
  },
  "adapterContaminationHelp": {
    "title": "Adapter Contamination",
    "content": "For fragments shorter than the read length, part of the adaptors would be sequenced leading to adaptor contamination."
  },
  "overlapHelp": {
    "title": "Overlapping reads",
    "content": "During paired-end sequencing, a DNA fragment is sequenced from either end. For short fragments, this could result in sequencing a stretch of the fragment twice. While this can lead to considerable wastage of sequencing effort, some studies might require these overlapping regions to build larger reads for more accurate alignment."
  },
  "tryOutRestrictionHelp": {
    "title": "Restriction Enzyme",
    "content": "Select a pair of restriction enzymes using the drop-down menu to in-silico digest the given fasta file. To compare multiple pairs of enzymes, click on '+' button to add more rows."
  },
  "coverageHelp": {
    "title": "Desired depth",
    "content": "The number of unique reads that include a given nucleotide in the reconstructed sequence."
  },
  "pairedEndHelp": {
    "title": "Paired end vs Single end",
    "content": "Paired-end sequencing allows users to sequence both ends of a fragment. Single-read sequencing involves sequencing DNA from only one end."
  },
  "fastaInputHelp": {
    "title": "Input fasta file",
    "content": "Insert the fasta file that you would like to be digested. The fasta file can be directly uploaded as a fasta file or as a (g)zipped fasta file. If your genome is larger (> 1Gb), it is recommended to gzip it beforehand."
  },
  "todayUploadedFilesHelp": {
    "title": "Files uploaded today",
    "content": "Here are the files listed that were uploaded today. Instead of uploading a fasta file again, you can select one of the given files and do the calculations."
  },
  "tryOutSnpDensity": {
    "title": "Expected SNP density in study population",
    "content": "Average number of SNPs per kilobase. For a detailed explanation see the user guide. The expected number of single nucleotide polymorphisms  (SNPs) varies greatly depending on the study organism, the population sampled, and the number of samples. For example, in pedigree or linkage map analyses the number of SNPs  would be smaller, as samples are from a single family, compared to phylogeographic studies that involve samples from multiple populations across the entire species range. A sample from a single location/population would have an intermediate number of SNPs, which would depend on the genetic diversity of that population (e.g. whether it has recently undergone a population bottleneck)."
  }
}